music_table={
  --从此处开始，直链均为网易云音乐
  "死別";
  "ヴァンパイア",
  "すとれいきゃっと",
  --  "乙女解剖";
  "匿名M",
  "太陽系デスコ",
  "砂の惑星 (砂之行星)",
  "ワールドイズマイン",
  "初音ミクの消失",
  "アンノウン・マザーグース",
  "Blessing",
  "ヴァンパイア",
  "妄想感傷代償連盟",
  "Ievan Polkka",
  "Miku",
  "メズマライザー(催眠术)",
  "ラビットホール(兔子洞)",
  "モニタリング(视奸)",
  "ねぇねぇねぇ。(呐呐呐。)",
  "命に嫌われている",
  "み む かゥ わ ナ イ ス ト ラ イ",
}
artist_table={
  --从此处开始，直链均为网易云音乐
  "シャノン,GUMI";
  "DECO*27,初音ミク";
  "タケノコ少年,初音ミク",
  --  "DECO*27,初音ミク",
  "ピノキオピー,初音ミク,ARuFa";
  "ナユタン星人,初音ミク",
  "米津玄師,初音ミク",
  "初音ミク ryo",
  "初音ミク CosMo@暴走P",
  "wowaka,初音ミク",
  "halyosy,初音ミク,鏡音リン,鏡音レン,巡音ルカ,KAITO,MEIKO",
  "DECO*27,初音ミク",
  "DECO*27,初音ミク",
  "初音ミク,Otomania",
  "初音ミク,Anamanaguchi",
  "サツキ,初音ミク,重音テト",
  "DECO*27,初音ミク",
  "DECO*27,初音ミク",
  "ピノキオピー,鏡音リン,初音ミク",
  "初音ミク,カンザキイオリ",
  "ぬ(好多不打了),初音ミク",
}
url_table={
  --从此处开始，直链均为网易云音乐
  "2134872913";
  "1840474281";
  "2157894445";
  --  "http://music.163.com/song/media/outer/url?id=1385116338.mp3";
  "2020725645";
  "459717345",
  "1317505406",
  "22677570",
  "514765051",
  "502455381",
  "1966112474",
  "1840474281",
  "432486474",
  "22677558",
  "406716121",
  "2153390036",
  "2043178301",
  "2639291583",
  "1859603835",
  "507795306",
  "2650843590",
}